---
kind: property
id: P:Autodesk.Revit.DB.SynchronizeWithCentralOptions.SaveLocalFile
source: html/02d064b9-a637-b7d3-0f86-3821bcbb472d.htm
---
# Autodesk.Revit.DB.SynchronizeWithCentralOptions.SaveLocalFile Property

Indicates whether Revit will save the local file at least once while synchronizing with central.

## Syntax (C#)
```csharp
public bool SaveLocalFile { get; }
```